export const cityData = [
    {
        id: "spb",
        name: "Санкт-Петербург",
        coldFiveDaysTemp: -24,
        heatingPeriodMonths: 7,
        monthlyTemps: {
            "Сентябрь": 11.4,
            "Октябрь": 5.7,
            "Ноябрь": 0.2,
            "Декабрь": -3.9,
            "Январь": -6.6,
            "Февраль": -6.3,
            "Март": -1.5,
            "Апрель": 4.5
        }
    },
    {
        id: "msk",
        name: "Москва",
        coldFiveDaysTemp: -26,
        heatingPeriodMonths: 7,
        monthlyTemps: {
            "Сентябрь": 10.5,
            "Октябрь": 4.7,
            "Ноябрь": -1.3,
            "Декабрь": -6.0,
            "Январь": -8.8,
            "Февраль": -8.0,
            "Март": -2.2,
            "Апрель": 5.7
        }
    },
    {
        id: "krd",
        name: "Краснодар",
        coldFiveDaysTemp: -15,
        heatingPeriodMonths: 4,
        monthlyTemps: {
            "Сентябрь": 18.1,
            "Октябрь": 11.9,
            "Ноябрь": 6.3,
            "Декабрь": 2.0,
            "Январь": -0.2,
            "Февраль": 1.0,
            "Март": 5.4,
            "Апрель": 12.2
        }
    },
    {
        id: "ekb",
        name: "Екатеринбург",
        coldFiveDaysTemp: -32,
        heatingPeriodMonths: 8,
        monthlyTemps: {
            "Сентябрь": 9.9,
            "Октябрь": 2.5,
            "Ноябрь": -5.5,
            "Декабрь": -11.2,
            "Январь": -13.7,
            "Февраль": -11.9,
            "Март": -4.1,
            "Апрель": 4.5
        }
    },
    {
        id: "nsk",
        name: "Новосибирск",
        coldFiveDaysTemp: -37,
        heatingPeriodMonths: 8,
        monthlyTemps: {
            "Сентябрь": 10.2,
            "Октябрь": 2.8,
            "Ноябрь": -7.3,
            "Декабрь": -14.7,
            "Январь": -17.7,
            "Февраль": -16.2,
            "Март": -8.2,
            "Апрель": 2.6
        }
    },
    {
        id: "kzn",
        name: "Казань",
        coldFiveDaysTemp: -29,
        heatingPeriodMonths: 7,
        monthlyTemps: {
            "Сентябрь": 11.5,
            "Октябрь": 4.2,
            "Ноябрь": -3.2,
            "Декабрь": -8.9,
            "Январь": -11.6,
            "Февраль": -10.9,
            "Март": -4.3,
            "Апрель": 5.3
        }
    },
    {
        id: "vbg",
        name: "Волгоград",
        coldFiveDaysTemp: -22,
        heatingPeriodMonths: 6,
        monthlyTemps: {
            "Сентябрь": 16.3,
            "Октябрь": 8.3,
            "Ноябрь": 1.1,
            "Декабрь": -4.4,
            "Январь": -6.9,
            "Февраль": -6.5,
            "Март": -0.3,
            "Апрель": 10.0
        }
    },
    {
        id: "smr",
        name: "Самара",
        coldFiveDaysTemp: -27,
        heatingPeriodMonths: 7,
        monthlyTemps: {
            "Сентябрь": 13.3,
            "Октябрь": 5.4,
            "Ноябрь": -2.1,
            "Декабрь": -8.3,
            "Январь": -11.2,
            "Февраль": -10.6,
            "Март": -3.7,
            "Апрель": 7.1
        }
    },
    {
        id: "rnd",
        name: "Ростов-на-Дону",
        coldFiveDaysTemp: -18,
        heatingPeriodMonths: 5,
        monthlyTemps: {
            "Сентябрь": 16.6,
            "Октябрь": 9.6,
            "Ноябрь": 3.3,
            "Декабрь": -1.5,
            "Январь": -3.8,
            "Февраль": -2.9,
            "Март": 2.2,
            "Апрель": 10.8
        }
    },
    {
        id: "ufa",
        name: "Уфа",
        coldFiveDaysTemp: -33,
        heatingPeriodMonths: 7,
        monthlyTemps: {
            "Сентябрь": 11.3,
            "Октябрь": 3.9,
            "Ноябрь": -3.9,
            "Декабрь": -10.8,
            "Январь": -13.8,
            "Февраль": -12.8,
            "Март": -5.3,
            "Апрель": 5.3
        }
    },
    {
        id: "krs",
        name: "Красноярск",
        coldFiveDaysTemp: -37,
        heatingPeriodMonths: 8,
        monthlyTemps: {
            "Сентябрь": 8.9,
            "Октябрь": 1.5,
            "Ноябрь": -7.5,
            "Декабрь": -13.7,
            "Январь": -16.0,
            "Февраль": -14.0,
            "Март": -6.3,
            "Апрель": 1.9
        }
    },
    {
        id: "vld",
        name: "Владивосток",
        coldFiveDaysTemp: -22,
        heatingPeriodMonths: 7,
        monthlyTemps: {
            "Сентябрь": 15.8,
            "Октябрь": 8.8,
            "Ноябрь": -0.9,
            "Декабрь": -9.5,
            "Январь": -12.6,
            "Февраль": -9.1,
            "Март": -2.1,
            "Апрель": 4.8
        }
    },
    {
        id: "irk",
        name: "Иркутск",
        coldFiveDaysTemp: -33,
        heatingPeriodMonths: 8,
        monthlyTemps: {
            "Сентябрь": 9.1,
            "Октябрь": 1.6,
            "Ноябрь": -7.9,
            "Декабрь": -15.7,
            "Январь": -18.4,
            "Февраль": -15.5,
            "Март": -6.9,
            "Апрель": 2.4
        }
    },
    {
        id: "khm",
        name: "Хабаровск",
        coldFiveDaysTemp: -29,
        heatingPeriodMonths: 7,
        monthlyTemps: {
            "Сентябрь": 13.6,
            "Октябрь": 4.9,
            "Ноябрь": -7.2,
            "Декабрь": -17.7,
            "Январь": -20.3,
            "Февраль": -16.0,
            "Март": -6.7,
            "Апрель": 4.5
        }
    },
    {
        id: "mrm",
        name: "Мурманск",
        coldFiveDaysTemp: -28,
        heatingPeriodMonths: 9,
        monthlyTemps: {
            "Сентябрь": 6.8,
            "Октябрь": 0.9,
            "Ноябрь": -4.9,
            "Декабрь": -8.2,
            "Январь": -10.5,
            "Февраль": -10.4,
            "Март": -5.8,
            "Апрель": -1.3
        }
    },
    {
        id: "arh",
        name: "Архангельск",
        coldFiveDaysTemp: -34,
        heatingPeriodMonths: 8,
        monthlyTemps: {
            "Сентябрь": 8.0,
            "Октябрь": 1.8,
            "Ноябрь": -4.8,
            "Декабрь": -9.9,
            "Январь": -13.6,
            "Февраль": -12.1,
            "Март": -5.7,
            "Апрель": 0.1
        }
    },
    {
        id: "soc",
        name: "Сочи",
        coldFiveDaysTemp: -3,
        heatingPeriodMonths: 3,
        monthlyTemps: {
            "Сентябрь": 19.8,
            "Октябрь": 15.6,
            "Ноябрь": 11.4,
            "Декабрь": 7.9,
            "Январь": 6.0,
            "Февраль": 6.2,
            "Март": 8.3,
            "Апрель": 12.2
        }
    },
    {
        id: "klg",
        name: "Калининград",
        coldFiveDaysTemp: -18,
        heatingPeriodMonths: 6,
        monthlyTemps: {
            "Сентябрь": 12.9,
            "Октябрь": 8.3,
            "Ноябрь": 3.4,
            "Декабрь": -0.4,
            "Январь": -2.2,
            "Февраль": -1.7,
            "Март": 1.7,
            "Апрель": 6.7
        }
    }
]; 